FamilyPlacementType Property
 Identifies the type of placement required by a given family.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public FamilyPlacementType FamilyPlacementType { get; }
  Visual Basic
Public ReadOnly Property FamilyPlacementType As FamilyPlacementType
	Get
  Visual C++
public:
property FamilyPlacementType FamilyPlacementType {
	FamilyPlacementType get ();
}
 See Also
  Family Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →